Repository: Luc-Ami/searchmonkey
Catalog: po/*.po
Languages: pt_pt

source: No content searching performed for this file. Please ensure containing search was enabled, and that an expression was entered prior to starting search.
pt_pt: Impossível de fazer uma pesquisa no conteúdo deste ficheiro. Verifique que esta função esta habilitada, e que uma expressão tenha sida entrada antes de iniciar a procura

source: Desktop search to replace find and grep.
pt_pt: Programa de pesquisa que substitui vantajosamente os comandos 'find' e 'grep'.

source: _File
pt_pt: _Ficheiro

source: _New Instance
pt_pt: _Nova instância

source: Save R_esults to CSV...
pt_pt: Salvar os R_esultados num ficheiro CSV...

source: _Edit
pt_pt: _Editar

source: _Delete (File)
pt_pt: R_emover este ficheiro

source: Edit File
pt_pt: Editar o ficheiro selecionado

source: Open Folder
pt_pt: Abrir a Pasta

source: _Copy (Filename)
pt_pt: _Copiar o caminho para o ficheiro seleccionado

source: _View
pt_pt: _Visualizar

source: Show _Statusbar
pt_pt: Mostrar a barra de _status

source: Horizontal results
pt_pt: Apresentar os resultados horizontalmente

source: Vertical results
pt_pt: Mostrar os resultados verticalmente

source: S_ort by
pt_pt: _Ordenar por

source: _File Name
pt_pt: Nome_Ficheiro

source: _Location
pt_pt: _Localização

source: _Size
pt_pt: _Tamanho

source: _Type
pt_pt: _Tipo

source: _Modified
pt_pt: _Modificado

source: Mat_ches
pt_pt: O_corrências

source: _Search
pt_pt: _Pesquisa

source: Start
pt_pt: Começar a pesquisa

source: Stop
pt_pt: Parar a pesquisa

source: Clear History...
pt_pt: Limpar o histórico...

source: Settings
pt_pt: Configuraçao

source: Use _Word Wrap
pt_pt: _Retorno a linha automática

source: Auto-size columns
pt_pt: Ajustar as colunas automaticamente

source: _Import Regular Expression...
pt_pt: _Importar Expressão(oes) Regular(es)...

source: _Export Regular Expression...
pt_pt: _Exportar Expressão(ões) Regular(es)...

source: Test Regular Expression...
pt_pt: Testa uma expressão regular...

source: _Help
pt_pt: _Ajuda

source: _User Guide
pt_pt: G_uia do utilizador

source: _Support
pt_pt: _Supporte

source: Release _Notes
pt_pt: _Notas de Versão

source: _Forums
pt_pt: _Fórums

source: Start the search!
pt_pt: Começar a pesquisa!

source: Stop the search!
pt_pt: Parar a pesquisa!

source: <b>Files:</b>
pt_pt: <b>Arquivos:</b>

source: Please, type here the name or a segment of the name of the file(s). Don't type spaces.
pt_pt: Favor entrar aqui o nome ou uma parte do nome de um o vários ficheiros Não utiliza espaços.

source: Use the wizard to create a file name regular expression...
pt_pt: Utilizar este assistente magico para criar uma expressão regular que se aplicara ao nome dos ficheiros...

source: Containing:
pt_pt: Contendo:

source: Use this option to restrict your search results to files containing the provided text (or pattern).
pt_pt: Utilizar esta opção para limitar o resultado da pesquisa aos ficheiros que contenham o texto indicado (ou o modelo de pesquisa).

source: Please, type here a word or a segment of a word researched in the file(s). Don't type spaces.
pt_pt: Favor entrar aqui uma palavra ou uma parte de uma palavra que você quer procurar num ou vários ficheiros Não utiliza espaços.

source: Use the wizard to create a containing text regular expression...
pt_pt: Utilizar este assistente magico para criar uma expressão regular que se aplicara ao conteúdo...

source: <b>Folders:</b>
pt_pt: <b>Registros:</b>

source: Recurse Folders
pt_pt: Procurar também nas sub-pastas

source: Use this option to search all subfolders (recursively).
pt_pt: Utilizar esta opção para pesquisar também nas sub-pastas (recursivamente).

source: Browse your file system and select the search directory...
pt_pt: Explora o seu sistema de ficheiros e seleccione a pasta de pesquisa...

source: Advanced mode :
pt_pt: Modo Avançado;

source: Advanced options
pt_pt: Opções avançadas

source: Click here to see all search options ...
pt_pt: Clique aqui para ver todas as opções de pesquisa ...

source: Invert Search Expression
pt_pt: Inverter a Expressão de Pesquisa

source: Inverts the file name search results i.e. find all becomes find none.
pt_pt: Inverter os resultados da pesquisa, isto é, achar 'todos' torne-se achar 'nenhum' ficheiro.

source: Match Case
pt_pt: Respeitar maiúsculos e minúsculos

source: Use strict file case matching.
pt_pt: Respeitar no nome dos ficheiros uma correspondência rigorosa de maiúsculas e minúsculas.

source: _Ignore files beginning with '.'
pt_pt: Ignorar os ficheiros escondidos

source: Ignore hidden files (Unix filesystems only)
pt_pt: Ignorar os ficheiros escondidos (unicamente para sistemas Unix)

source: Follow Symbol _Links
pt_pt: Seguir Ligações Simbólicas

source: Follow Symbolic Links (Only on systems that support them)
pt_pt: Seguir Ligações Simbólicos (somente em sistemas que suportam)

source: Use Wil_dcard Syntax
pt_pt: Permitir o uso de _jokers

source: Use wildcard or glob syntax for file search criteria. E.g. *.txt
pt_pt: Utilizar jokers ou uma sintaxe 'glob' para os critérios de pesquisa de ficheiros, p.e. *.txt

source: Use _Regular Expression Syntax
pt_pt: Autorizar unicamente uma sintaxe conforme as expressões regulares

source: Use regular expression syntax in file search criteria.
pt_pt: Utilizar a sintaxe de 'expressões regulares' como critério de pesquisa nos ficheiros.

source: <b>File Name Options</b>
pt_pt: <b>Para os ficheiros</b>

source: Use Single Phase Search
pt_pt: Fazer as pesquisas em somente uma fase

source: Perform content searching immediately so that results are returned quicker.
pt_pt: Começar a pesquisa de conteúdo imediatamente afim de obter os resultados mais rápidos.

source: Use strict contents case matching.
pt_pt: Respeitar no conteúdo uma correspondência rigorosa de maiúsculas e minúsculas.

source: Use simple search syntax
pt_pt: Utilizar uma sintaxe simples para pesquisa

source: <b>File Contents Options</b>
pt_pt: <b>Para o Conteúdo</b>

source: Restrict depth:
pt_pt: Limitar a profundidade das sub-pastas:

source: Limit files found by selecting maximum tree-depth to search.
pt_pt: Limitar o numero de resultados em seleccionando a profundidade máxima no árvore de pastas onde se fará a pesquisa. Um valor zero significa: limitar a procura a pasta corrente.

source: Limit Match Files
pt_pt: Limitar o numero de ficheiros achados

source: Specify the maximum number of matching files found. Does not limit the number of content matches within each file.
pt_pt: Especifica o numero máximo de ocorrências de ficheiros achados. Isto não limite a numero de ocorrências em cada ficheiro.

source: Maximum Hits:
pt_pt: Resultados exibidos:

source: Show Line Contents
pt_pt: Mostrar a linha/paragrafo contento o texto pesquisado

source: If active, display extra lines around the matching line to help show context of match.
pt_pt: Se activo, searchmonkey vai mostrar linhas adicionais antes e depois da linha onde se encontra o texto pesquisado afim de situar o contexto da ocorrência.

source: Lines Displayed:
pt_pt: Numero de linhas mostradas:

source: Limit Content Highlighting
pt_pt: Limitar o realçamento na mesma linha/paragrafo

source: Specify the maximum number of content matches within each file to show. Does not limit the number of files to search.
pt_pt: Especifica o numero máximo de ocorrências no interior de um ficheiro. Isto não limita a numero de ficheiros a pesquisar.

source: Highlights per line :
pt_pt: Realçar por linha:

source: <b>Results Options</b>
pt_pt: <b>Para os resultados</b>

source: List of file(s) corresponding to research criteria.
pt_pt: Lista de ficheiro(s) que corresponde ao critério de pesquisa.

source: Displays the matching text lines when the result is selected.
pt_pt: Mostra as linhas de texto correspondentes quando o resultado é seleccionado.

source: Click here to set-up size and date search options ...
pt_pt: Clique aqui para configurar as opções de pesquisa de tamanho e data ...

source: <b> Search filters </b>
pt_pt: <b> Filtros de pesquisa </b>

source: Search progress bar.
pt_pt: Barra de progressão da pesquisa

source: Select a folder
pt_pt: Seleccionar uma pasta

source: Edit (File)
pt_pt: Editar este ficheiro

source: _Delete File
pt_pt: R_emover este ficheiro

source: _Explore Folder
pt_pt: _Percorrer a pasta selecionnada

source: C_ancel
pt_pt: C_ancelar

source: Select highlighting Colour
pt_pt: Seleccionar a cor de realçamento

source: Select Font
pt_pt: Seleccionar uma fonte

source: Clear Search History
pt_pt: Limpar o histórico de pesquisa

source: <b>Select which data to delete:</b> With this dialog, you can control how your entries will be cleared.
pt_pt: <b>Selecione quais dados a serem limpadas:</b> Com esta caixa de dialogo, você controla as entradas a serem limpadas.

source: Clear file names
pt_pt: Limpar o nome dos ficheiros

source: Clear all file names in the "Files:" drop-down list
pt_pt: Limpar todos os nomes na lista suspensa "Ficheiros:"

source: Clear containing text
pt_pt: Limpar os textos pesquisados

source: Clear all patterns in the "Containing:" drop-down list
pt_pt: Limpar todos os padrões na lista suspensa "Contendo:"

source: Clear look in history
pt_pt: Limpar o histórico dos ficheiros pesquidados

source: Clear all directories in the "Folders:" drop-down list
pt_pt: Limpar todos os directórios na lista suspensa "Pastas:"

source: Reset size/modified options
pt_pt: Reinicializar as opções de tamanho/modificação

source: Reset the size and modified search criteria.
pt_pt: Reinicializar os critérios de pesquisa de 'tamanho' e 'data de modificação'.

source: <b>Warning</b>: Once cleared, history cannot be recovered!
pt_pt: <b>Atenção !</b> O histórico será removido para sempre !

source: Test Regular Expression
pt_pt: _Testar uma expressão regular

source: <b>Test Regular Expressions (RegEx):</b> <i>With this dialog, you can test a RegEx before using it. Feel free to type a RegEx and put an example of text to test it.</i>
pt_pt: <b>Testar uma Expressao Regular (RegEx) :</b> <i>Esta caixa de dialogo permite testar uma RegEx antes de sua utilizaçao. Afim de fazer um ensaio entre uma RegEx de sua escolha junto com uma amostra do texto .</i>

source: <b>Test Expression</b>:
pt_pt: <b>Formula de expressão regular a ser testada:</b>

source: sample
pt_pt: exemplo

source: <b>Sample Text:</b>
pt_pt: <b>Texto a analisar com esta expressão:</b>

source: <Copy and paste your sample text here>
pt_pt: <Copiar e colar o texto de amostra aqui>

source: To see the results of your regular expression click apply. Once done, simply close the window. Searches are case sensitive. <b>Note:</b> this tool will highlight <i>each</i> match(es) found.
pt_pt: Para ver os resultados de sua expressão clique em aplicar e em seguida fecha a janela. As pesquisas são sensíveis a maiúsculos e minúsculos. <b>Nota:</b> esta ferramenta vai realçar a(s) ocorrência(s).

source: Expression Wizard
pt_pt: Assistente magico para Expressões Regulares

source: <b>Text begins:</b>
pt_pt: <b>O texto comece por :</b>

source: Don't know
pt_pt: Não sei

source: Any character
pt_pt: Qualquer carácter

source: The character
pt_pt: O caractere

source: Any one of these chars
pt_pt: Qualquer um destes caracteres

source: Any char except these
pt_pt: Qualquer carácter excepto estes

source: The phrase
pt_pt: A frase

source: Space(s)
pt_pt: Espaço(s)

source: Any numeric character
pt_pt: Qualquer carácter numerico

source: Any text character
pt_pt: Qualquer carácter alfabetico

source: that occurs
pt_pt: que occore

source: Once
pt_pt: Uma vez

source: One or more times
pt_pt: Mais uma vez

source: Zero or more times
pt_pt: Zero ou mais vezes

source: Possibly once
pt_pt: Unicamente uma vez

source: Each row creates a new part to the rule, with the order reflecting the order in which the rule is to be matched.
pt_pt: Cada linha cria uma nova parte na regra, sendo que a posição vai determinar a ordem no qual a regra será examinada.

source: Add
pt_pt: Adicione

source: Creates a new row in the list with the following rule.
pt_pt: Criar uma nova linha na lista com a regra seguinte.

source: Update
pt_pt: Atualizar

source: Updates a rule that was selected for the modify function.
pt_pt: Atualiza uma regra que foi selecionada na função 'modificar'

source: Modify
pt_pt: Modificar

source: Modifies an existing row in the rule table.
pt_pt: Modifica uma linha existente la tabela de regras

source: Delete
pt_pt: Remover

source: Deletes an existing row in the rule table.
pt_pt: Remover uma linha nesta tabela de regras.

source: <b>Text contains</b>
pt_pt: <b>O texto contem</b>

source: <b>Text ends:</b>
pt_pt: <b>O texto termine por:</b>

source: This is the expression that will be copied back to the main screen.
pt_pt: Esta é a expressão que será copiada de volta para a tela principal.

source: Convert Internals
pt_pt: Corrigir caracteres de controle

source: Some characters (such as . | ^ $) are reserved in certain circumstances. If you know what you are doing with these characters, unselect this checkbox.
pt_pt: Certos caracteres (tal como . | ^ $) ) sao caracteres de controle e portanto fazem parte de uma syntaxe reservada. Eles não devem ser utilizadas sem razão numa expressão regular. Seleccionando esta opção, Searchmonkey tentara de corrigir os seus erros. Se você domina o que esta fazendo pode remover esta selecção.

source: <b>Resulting expression</b>
pt_pt: <b>Expressão resultante</b>

source: Help with the Regular Expression Builder
pt_pt: Ajuda para o assistente de Expressões RegEX

source: Discard any changes.
pt_pt: Abandonar todas as modificações.

source: Accept the resulting expression, and add it to the search rules.
pt_pt: Aceita a expressão resultante, e acrescente-a as regras de pesquisa.

source: Configuration
pt_pt: Configuração

source: Force single window mode
pt_pt: Forçar o modo de janela única

source: Use extended regular expressions
pt_pt: Autorizar expressões regulares estendidas

source: Extended regular expressions are recommended as they provide more functionality.
pt_pt: As expressões regulares estendidas são recomendadas porque oferecem mais funcionalidades

source: Prompt before saving state
pt_pt: Confirmar antes de salvar os dados

source: Force a prompt before settings are saved.
pt_pt: Pedir confirmação antes de salvar a configuração.

source: Prompt before deleting files
pt_pt: Confirmar antes de apagar ficheiros

source: Force a prompt before any files are deleted
pt_pt: Pedir confirmação antes de remover ficheiros

source: Match strings within binary files too
pt_pt: Pesquisar cadeias de texto também em ficheiros binários

source: Check this to allow
pt_pt: Seleccione a caixinha afim de autorizar

source: Global Settings
pt_pt: Configuração global

source: Default text editor:
pt_pt: Editor de texto predeterminado:

source: Default folder explorer:
pt_pt: Navegador de ficheiros predeterminado:

source: Default web browser:
pt_pt: Navegador Internet predeterminado:

source: Binary/Executable
pt_pt: Binário/Executável

source: Attributes
pt_pt: Atributos

source: Text editor attributes: %f=filename, %d=directory
pt_pt: Parâmetros do editor de texto: %f=nome do ficheiro, %d=pasta

source: File explorer attributes: %f=filename, %d=directory
pt_pt: Atributos do navegador de ficheiros: %f=nome do ficheiro, %d=pasta

source: Paste and edit full file name of your preferred text editor.
pt_pt: Colar e modificar o nome completo do seu editor de texto preferido.

source: Paste and edit full file name of your preferred file explorer.
pt_pt: Colar e modificar o nome completo do seu explorador de ficheiros preferido.

source: Paste and edit full file name of your preferred web browser.
pt_pt: Colar e modificar o nome completo do seu navegador Internet preferido.

source: Find default executables:
pt_pt: Determinar as aplicações predeterminadas neste computador:

source: Auto search...
pt_pt: Pesquisa automática...

source: Default Applications
pt_pt: Aplicações predeterminadas

source: End of row separator:
pt_pt: Caractere que marca o fim de uma linha:

source: Use ASCII or C style construct e.g. \n
pt_pt: Utiliza o estilo ASCII ou C, por exemplo, \n

source: Value/field separator:
pt_pt: Separador de campo/valor:

source: Use ASCII or C style construct e.g. , \t ;
pt_pt: Utiliza o estilo ASCII ou C, por exemplo, \t ;

source: Text delimiter:
pt_pt: Delimitador de texto:

source: Use ASCII characters e.g. " # $ '
pt_pt: Utiliza caracteres ASCII, p.e. " # $ '

source: Csv Export
pt_pt: Exportar Csv

source: Remove all saved settings (restart required to complete):
pt_pt: Limpar a configuração actual (o relançamento de Searchmonkey é necessária)

source: Reset all
pt_pt: Reinicializar todo

source: Save settings immediately (normally occurs on exit):
pt_pt: Salvar a configuração actual agora (normalmente ocorre quando sai do programa)

source: Save now
pt_pt: Salvar agora

source: Current Config file location:
pt_pt: Localização actual do ficheiro de configuração:

source: Location of your current searchmonkey configuration settings file.
pt_pt: Localizaçao actual do ficheiro de configuração

source: System
pt_pt: Sistema

source: Searching for system files, please wait...
pt_pt: Pesquisando ficheiros do sistema, favor aguardar...

source: Save results to CSV file...
pt_pt: Salvar os resultados num ficheiro CSV...

source: Import Criteria
pt_pt: Importar os critérios de pesquisa

source: File Selection
pt_pt: Seleccionar o ficheiro

source: File Name import
pt_pt: Formula de Expressão Regular para pesquisar ficheiros específicos

source: Use the file in an identical to way to that of the grep -f command.
pt_pt: Utilizar o ficheiro da mesma maneira que o comando 'grep -f'

source: Containing Text import
pt_pt: Formula de Expressão Regular para pesquisar um texto especifico num ficheiro

source: Import a file identical to that generated by the export command.
pt_pt: Importar um ficheiro idêntico ao aquele que foi produzido pelo comando 'exportar'.

source: <b>Import Location</b>
pt_pt: <b>Conteúdo para importação</b>

source: Grep style file (1-entry, OR each line)
pt_pt: Estilo de ficheiros Grep (1-entrada, OU cada linha)

source: Searchmonkey style (1-entry per line)
pt_pt: Estilo searchmonkey (1-entrada por linha)

source: <b>Import Type</b>
pt_pt: <b>Organização dos dados a importar</b>

source: Options
pt_pt: Opções

source: Export Criteria
pt_pt: Exportar os critérios de pesquisa...

source: File Name Export criteria
pt_pt: As entradas para o campo 'ficheiros'

source: Save the File Name drop down entries into a file.
pt_pt: Salvar as entradas da lista suspensa 'Ficheiros'

source: Containing Text Export Criteria
pt_pt: Os dados entrados no campo "Contendo"

source: Save the Containing Text drop down entries into a file.
pt_pt: Salvar a lista de entradas do campo 'Contendo' num ficheiro

source: <b>Export Source</b>
pt_pt: <b>Escolha das expressões regulares a exportar</b>

source: Save active/displayed entry only
pt_pt: Salvar somente o ultimo valor entrado

source: Just save the currently displayed entry to a file.
pt_pt: Salvar somente a entrada na tela, sendo o campo 'ficheiro', ou sendo o campo 'Contendo'

source: Save all entries (1-entry per line)
pt_pt: Memorizar no histórico todas as expressões regulares (o ficheiro terá uma entrada por linha)

source: <b>Export Type</b>
pt_pt: <b>Escolha do numero de expressões regulares a exportar</b>

source: Auto Complete
pt_pt: Autocompletar

source: Please be patient! Searching for executables to perform the following functions: * text editing/viewing * folder browsing * web browsing The search algorithm uses a set of standard executables for all systems, and then attempts to find them on your local disk. Once complete, press OK to store the executables.
pt_pt: Aguarda um pouco Esta procurando programas para as seguintes funções: * Editar ficheiros * Explorar pastas * Navegar no Internet O algoritmo de pesquisa utiliza um conjunto de programas comum a todos os sistemas e tenta achar-lo no disco local. Uma vez completada, aperta OK para salvar os programas.

source: Search progress
pt_pt: Pesquisa em curso

source: Please wait...
pt_pt: Espera um pouquinho...

source: Project Manager:
pt_pt: Gestor de projeto:

source: Programming:
pt_pt: Programação:

source: Artwork:
pt_pt: Obra de arte:

source: Searchmonkey logos + main icon :
pt_pt: Searchmonkey logos+ícone principal:

source: Regular expression power search utility written in GTK+ and licensed under GPL v.3
pt_pt: <i>Utilitário de pesquisa poderoso baseado em 'expressões regulares", escrito em GTK+ sob licença GPL v.3</i>

source: Translators credits
pt_pt: Traduzido por

source: Select Date...
pt_pt: Seleccionar uma data...

source: <b>Today :</b>
pt_pt: <b>Hoje:</b>

source: <b><big>Date filters settings</big></b> Here you can setup various date settings in order to refine yours searches. - choose <i>after</i> in order to filter files newer than this date. - choose <i>before</i> in order to filter files older than this date. - you can combine <i>after</i> and <i>before</i> settings.
pt_pt: <b> <big> Configurações dos filtros de data </big> </b> Aqui você pode configurar várias configurações de data para refinar suas pesquisas. - escolha <i> depois </i> para filtrar arquivos mais novos que esta data. - escolha <i> antes </i> para filtrar arquivos anteriores a essa data. - você pode combinar as configurações <i> após </i> e <i> antes </i>.

source: <b>Modified :</b>
pt_pt: <b>Modificado:</b>

source: _Any date
pt_pt: _Qualquer data

source: _Today
pt_pt: _hoje

source: _From :
pt_pt: _De:

source: _Until :
pt_pt: _para cima:

source: _Interval :
pt_pt: _Intervalo:

source: _Since :
pt_pt: _De:

source: <i>starting</i>
pt_pt: <i> começando </i>

source: <i>and ending</i>
pt_pt: <i> e terminando </i>

source: Use this option to choose the date units.
pt_pt: Utilizar esta opçao para escolher a unidade de data dos ficheiros.

source: Day(s)
pt_pt: dia(s)

source: Week(s)
pt_pt: Semana

source: Month(s)
pt_pt: Mês

source: Quarter(s)
pt_pt: Alojamento

source: Year(s)
pt_pt: Ano(s)

source: <b>Choose files size options:</b> If you don't want to limit the search, <i>uncheck</i> all options. In other cases, check one of the options, if you only want to search files lower or greater than a size. Check the <i>two</i> options if you want to find files <i>only</i> in a size interval.
pt_pt: <b> Escolha as opções de tamanho dos arquivos: </b> Se você não quiser limitar a pesquisa, <i> desmarque </i> todas as opções. Em outros casos, marque uma das opções, se desejar pesquisar apenas arquivos menores ou maiores que um tamanho. Verifique as duas <i> opções </i> se quiser encontrar arquivos <i> somente </i> em um intervalo de tamanho.

source: <b>Size :</b>
pt_pt: <b>Tamanho:</b>

source: More than:
pt_pt: Maior que:

source: Use this option to restrict your search results to files that are bigger than the provided number of kilo Bytes.
pt_pt: Utilizar esta opção para limitar o resultado da pesquisa aos ficheiros com tamanho maior que o numero especificado.

source: Maximum filesize in kBytes/mBytes/gBytes.
pt_pt: Tamanho máximo em Kbytes/Mbytes/Gbytes.

source: Use this option to choose the file size units.
pt_pt: Utilizar esta opçao para escolher a unidade de tamanho dos ficheiros. Você pode misturar as unidades.

source: <b>and/or </b>
pt_pt: <b>e/ou </b>

source: Less than:
pt_pt: Menor que:

source: Use this option to restrict your search results to files that are smaller than the provided number of kilo Bytes.
pt_pt: Utilizar esta opção para limitar o resultado da pesquisa aos ficheiros com tamanho menor que o numero especificado.

source: Minimum filesize in kBytes/mBytes/gBytes.
pt_pt: Tamanho mínimo em Kbytes/Mbytes/Gbytes.
