Repository: Luc-Ami/searchmonkey
Catalog: po/*.po
Languages: pt_pt

source: Internal Error! Unable to find calling wizard type!
pt_pt: Erro interno! Impossível de determinar qual assistente magico dever ser utilizado!

source: (Type)
pt_pt: (Tipo)

source: (Entry)
pt_pt: (Valor)

source: (Repeat)
pt_pt: (Repetir)

source: File Expression Wizard
pt_pt: Assistente magico para construção de uma Expressão Regular de pesquisa de ficheiros

source: Context Expression Wizard
pt_pt: Assistente magico para a construção de uma Expressão Regular de pesquisa de conteúdo

source: Are you sure that you wish to delete the config file, and restart searchmonkey?
pt_pt: Tem certeza que queira remover o ficheiro de configuração, e reiniciar searchmonkey?

source: Error! Unable to remove config file %s.
pt_pt: Erro! Incapaz de remover o ficheiro de configuração %s.

source: /Max hits limit:%d
pt_pt: /limite de acessos máximos:%d

source: /No Max hits limit
pt_pt: /Sem limite de acessos máximos

source: %s/research mode with jokers(DOS like)
pt_pt: %s/Modo de pesquisa com Jokers(estilo DOS)

source: %s/research mode with RegEx
pt_pt: %s/Modo de pesquisa com RegEX

source: <b>Error!</b> Dates mismatch ! 'Before than' date must be <i>more recent</i> than 'After than' date. Please check the dates.
pt_pt: <b>Erro!</b> Incompatibilidade de datas ! A data 'Antes de' deve ser <i>mais recente</i> que a data 'Depois de'. <b>A pesquisa nao pode ser executada correctamente !</b> Favor verificar as datas.

source: <b><u>Look in :</u></b>
pt_pt: <b><u>Investigar :</u></b>

source: Error! Invalid 'file name' regular expression
pt_pt: Erro! Expressão regular com 'Nome de Ficheiro' invalido

source: Error! Invalid 'containing text' regular expression
pt_pt: Erro! Expressão regular com 'Contendo Texto' invalido

source: Couldn't find pixmap file: %s
pt_pt: Impossível de localizar o ficheiro pixmap: %s

source: <b>Error!</b> MoreThan file size must be <i>positive</i> value So this criteria will not be used. Please, check your entry and the units.
pt_pt: <b>Erro!</b> O tamanho de ficheiro MaiorQue deve ser um valor <i>positivo</i> Por isto este critério não poderá ser utilizado. Favor verificar a sua entrada e as unidades.

source: <b>Error!</b> MoreThan file size must be <i>stricly inferior</i> to LessThan file size.So this criteria will not be used. Please, check your entry and the units.
pt_pt: <b>Erro!</b> O tamanho de ficheiro MaiorQue deve ser <i>rigorosamente inferior</i> ao MenorQue. Por isto este critério não poderá ser utilizado. Favor verificar a sua entrada e as unidades.

source: <b>Error!</b> LessThan file size must be <i>positive</i> value So this criteria will not be used. Please, check your entry and the units.
pt_pt: <b>Erro!</b> O tamando de ficheiro MenorQue deve ser um valor <i>positivo</i> Por isto este critério não poderá ser utilizado. Favor verificar a sua entrada e as unidades.

source: <b>Error!</b> Invalid 'After'date - format as dd/mm/yyyy or dd mmm yy.
pt_pt: <b>Erro!</b> O formato da data 'Depois' deve ser do tipo dd/mm/yyyy ou dd mmm yy.

source: <b>Error!</b> Invalid 'Before' date - format as dd/mm/yyyy or dd mmm yy.
pt_pt: <b>Erro!</b> O formato da data 'Antes' dever ser do tipo dd/mm/yyyy ou dd mmm yy.

source: <b>Error!</b> Invalid 'Interval'date(s) - format as dd/mm/yyyy or dd mmm yy.
pt_pt: <b>Erro!</b> O formato da data 'Depois' deve ser do tipo dd/mm/yyyy ou dd mmm yy.

source: <b>Error!</b> Dates mismatch ! 'Before than' date must be <i>more recent</i> than 'After than' date. <b>Search can't proceed correctly !</b> Please check the dates.
pt_pt: <b>Erro!</b> Incompatibilidade de datas ! A data 'Antes de' deve ser <i>mais recente</i> que a data 'Depois de'. <b>A pesquisa nao pode ser executada correctamente !</b> Favor verificar as datas.

source: Error! Look In directory cannot be blank.
pt_pt: Erro! A pré visualização da pasta não pode ser vazia.

source: Error! Look In directory is invalid.
pt_pt: Erro! A pré visualização da pasta é invalida.

source: Error! Invalid File Name regular expression
pt_pt: Erro! Expressão regular com 'Nome de Ficheiro' invalido

source: Error! Invalid Containing Text regular expression
pt_pt: Erro! Expressão regular com 'Contendo Texto' invalido

source: Searchmonkey : search in %s/
pt_pt: Searchmonkey : pesquisa em %s/

source: Aborting research-Searchmonkey
pt_pt: Abortando a pesquisa-Searchmonkey

source: Phase 1 searching %s
pt_pt: Fase 1 procurando %s

source: Phase 2 starting...
pt_pt: Fase 2 esta começando...

source: Phase 2 searching %s
pt_pt: Fase 2 procurando %s

source: %s-type
pt_pt: %s-tipo

source: Unknown
pt_pt: Desconhecido

source: %d file found
pt_pt: %d ficheiro achado

source: %d files found
pt_pt: %d ficheiros achados

source: [cancelled]
pt_pt: [interrompido]

source: -research mode with jokers(DOS like)
pt_pt: -Modo de pesquisa com jokers(similar a DOS )

source: -research mode with RegEx
pt_pt: -Modo de pesquisa com RegEx

source: %s settings auto-generated - Do not edit!
pt_pt: %s configuração auto-gerada - Não edite!

source: Configuration files are for a different version of Searchmonkey. This may cause errors. Delete old configuration files?
pt_pt: Os ficheiros de configuração são para uma versão diferente de Searchmonkey o que pode causar erros. Deseja remover os antigos ficheiros de configuração?

source: About to overwrite save configuration. Do you want to proceed?
pt_pt: Está no ponto de sobrescrever o ficheiro de configuração. Quer continuar ?

source: Error saving %s: %s
pt_pt: Erro durante o salvamento %s: %s

source: [missing]
pt_pt: [faltando]

source: Name
pt_pt: Nome

source: Location
pt_pt: Localização

source: Size
pt_pt: Tamanho

source: Type
pt_pt: Tipo

source: Modified
pt_pt: Modificado

source: Matches
pt_pt: Ocorências

source: Ready-research mode with jokers(DOS like)
pt_pt: Pronto-Modo de procura com Jokers(estilo DOS)

source: Ready-research mode with RegEx
pt_pt: Pronto-Modo de procura com RegEX

source: Paragraph Number: %d
pt_pt: Paragrafo Numero: %d

source: Line Number: %d
pt_pt: Numero de linha: %d

source: Internal error %d! Unable to highlight line - offset beyond line-end.
pt_pt: Erro interno %d! Impossível de realçar além do final da linha.

source: Please email all debug text to cottrela@users.sf.net.
pt_pt: Favor enviar o texto de depuração (ler no terminal) a cottrela@users.sf.net.

source: Options:
pt_pt: Opções:

source: case sensitive;
pt_pt: Sensível a maiúsculas e minúsculos;

source: display 1 extra line around match;
pt_pt: Mostrar uma linha adicional em torno da ocorrência;

source: display %d extra lines around match;
pt_pt: Mostrar %d linhas adicionais em torno do ocorrência;

source: only showing line numbers;
pt_pt: mostrar somente os números de linha;

source: only showing first content match;
pt_pt: mostrar somente a primeira ocorrência;

source: only showing first %d content matches;
pt_pt: mostrar somente as primeiras %d ocorrência;

source: none
pt_pt: nenhum

source: Did not match any.
pt_pt: Nenhuma occorencia.

source: Found 1 match.
pt_pt: Achou uma ocorrência.

source: Found %d matches.
pt_pt: Achou %d ocorrências.

source: File name
pt_pt: Nome de ficheiro

source: File size
pt_pt: Tamanho do ficheiro

source: File type
pt_pt: Tipo de ficheiro

source: Modified date
pt_pt: Data de modificaçao

source: No results to save!
pt_pt: Não há resultados a salvar!

source: A file named "%s" already exists. Are you sure you want to overwrite it?
pt_pt: Já existe um ficheiro com nome "%s". Tem certeza que quer sobrescrever ?

source: File was empty/invalid.
pt_pt: O ficheiro é vazio/invalido.

source: Error! No valid file selected.
pt_pt: Erro! Nenhum ficheiro valido seleccionado.

source: Error! You must select at least one entry in order to save drop down list.
pt_pt: Erro! Pelo menos uma entrada na lista suspensa deve ser seleccionado.

source: Error! Unable to find first combo entry. Is drop down list blank?
pt_pt: Erro! Incapaz de achar a primeira linha na lista suspensa. Esta vazia?

source: Illegal escape sequence: '\%c'. Valid escape characters are: b n r t " \
pt_pt: Sequência de escape ilegal: '\%c'. Caracteres de escape validos são: b n r t " \

source: Input string expands into non ASCII, or multi-byte key sequence: '%s'. Please try to use ASCII safe keys
pt_pt: A cadeia entrada contem caracteres que não são ASCII, ou uma sequência de teclas multi-byte: '%s'. Favor utilizar somente teclas ASCII

source: Multi-byte string entered: '%s'. Truncating extra character (%c)
pt_pt: Uma cadeia de texto multi-byte foi entrada: '%s'. O carácter adicional (%c) foi truncado

source: Run configuration to set default web-browser: "%s"
pt_pt: Favor iniciar a configuração padrão para o navegador Internet: "%s"

source: Run configuration to set default text editor: "%s"
pt_pt: Favor abrir o menu de configuração para seleccionar um editor de texto padrão para : "%s"

source: Run configuration to set default directory/folder browser: "%s"
pt_pt: Impossível de lançar o navegador de ficheiros para abrir : "%s" Favor abrir o menu de configuração para seleccionar um navegador padrão.

source: Cannot delete file as name was not selected.
pt_pt: Impossível de remover pois nenhum ficheiro foi seleccionado.

source: Are you sure you want to delete: '%s'
pt_pt: Tem certeza que quer remover: '%s'

source: Cannot copy full file name as name was not selected.
pt_pt: Impossível de copiar o caminho do ficheiro pois nenhum foi seleccionado.

source: %s Error! Unable to split %s with %c
pt_pt: %s Erro! Impossível de dividir %s com %c

source: %s Error! Unable to duplicate string vector
pt_pt: %s Erro! Impossível de duplicar o vector da cadeia
